/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "Ακύρωση",
  alert_retry_btn: "Επανάληψη",
  blur_detected: "Κρατήστε το έγγραφο και το τηλέφωνο ακίνητα",
  camera_angle_too_steep: "Κρατήστε το έγγραφο παράλληλα με το τηλέφωνο",
  document_filtered: "Το έγγραφο δεν έγινε δεκτό",
  document_filtered_details: "Δοκιμάστε να σαρώσετε ένα διαφορετικό έγγραφο.",
  document_not_recognized: "Το έγγραφο δεν αναγνωρίστηκε",
  document_not_recognized_details:
    "Σαρώστε την μπροστινή όψη ενός υποστηριζόμενου εγγράφου.",
  document_too_close_to_edge: "Μετακινήστε το έγγραφο από την άκρη",
  face_photo_not_fully_visible:
    "Φροντίστε τη φωτογραφία προσώπου να είναι πλήρως ορατή",
  flip_document: "Αναποδογυρίστε το έγγραφο",
  flip_to_back_side: "Γυρίστε στην πίσω όψη",
  glare_detected:
    "Γείρετε ή μετακινήστε το έγγραφο για να αφαιρέσετε την αντανάκλαση",
  help_aria_label: "Βοήθεια",
  help_modal_back_btn: "Πίσω",
  help_modal_details_1:
    "Βεβαιωθείτε ότι δεν καλύπτετε μέρη του εγγράφου με το δάχτυλό σας, συμπεριλαμβανομένων των κάτω γραμμών. Επίσης, προσέξτε τις αντανακλάσεις ολογράμματος που καλύπτουν τα πεδία του εγγράφου.",
  help_modal_details_2:
    "Αποφύγετε το άμεσο, έντονο φως, επειδή αντανακλάται από το έγγραφο και μπορεί να κάνει ορισμένα μέρη του εγγράφου δυσανάγνωστα. Εάν δεν μπορείτε να διαβάσετε δεδομένα στο έγγραφο, δεν θα είναι ορατά ούτε στην κάμερα.",
  help_modal_details_3:
    "Προσπαθήστε να κρατήσετε το τηλέφωνο και το έγγραφο ακίνητα κατά τη σάρωση. Η μετακίνηση οποιουδήποτε από τα δύο μπορεί να θολώσει την εικόνα και να καταστήσει τα δεδομένα στο έγγραφο δυσανάγνωστα.",
  help_modal_done_btn: "Τέλος",
  help_modal_next_btn: "Επόμενο",
  help_modal_title_1: "Φροντίστε όλα τα πεδία να είναι ορατά",
  help_modal_title_2: "Προσέξτε το έντονο φως",
  help_modal_title_3: "Μείνετε ακίνητοι κατά τη σάρωση",
  help_tooltip: "Χρειάζεστε βοήθεια;",
  move_closer: "Πλησιάστε",
  move_farther: "Απομακρυνθείτε",
  move_left: "Προχωρήστε στη σελίδα στα αριστερά",
  move_right: "Προχω΄ρηστε στη σελίδα στα δεξιά",
  move_top: "Προχωρήστε στην πρώτη σελίδα",
  occluded: "Φροντίστε το έγγραφο να είναι πλήρως ορατό",
  onboarding_modal_btn: "Έναρξη σάρωσης",
  onboarding_modal_details:
    "Φροντίστε το έγγραφο να είναι καλά φωτισμένο. Όλα τα πεδία του εγγράφου θα πρέπει να είναι ορατά στην οθόνη της κάμερας.\n",
  onboarding_modal_title: "Φροντίστε όλες οι λεπτομέρειες να είναι ορατές",
  scan_data_page: "Σαρώστε τη σελίδα δεδομένων του εγγράφου",
  scan_last_page_barcode: "Σάρωση γραμμωτού κώδικα από την τελευταία σελίδα",
  scan_left_page: "Σαρώστε την αριστερή σελίδα",
  scan_right_page: "Σαρώστε τη δεξιά σελίδα",
  scan_the_back_side: "Σαρώστε την πίσω όψη του εγγράφου",
  scan_the_barcode: "Σαρώστε τον γραμμωτό κώδικα",
  scan_the_front_side: "Σαρώστε την μπροστινή όψη του εγγράφου",
  scan_top_page: "Σαρώστε την πρώτη σελίδα",
  scan_unsuccessful: "Η σάρωση ήταν ανεπιτυχής.",
  scan_unsuccessful_details:
    "Δεν είναι δυνατή η ανάγνωση του εγγράφου. Δοκιμάστε ξανά.",
  too_bright: "Μετακινηθείτε σε σημείο με λιγότερο φωτισμό",
  too_dark: "Μετακινηθείτε σε πιο φωτεινό σημείο",
  wrong_left: "Προχωρήστε στην αριστερή σελίδα",
  wrong_right: "Προχωρήστε στη δεξιά σελίδα",
  wrong_top: "Προχωρήστε στην πρώτη σελίδα",
} as const;
