/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "रद्द करें",
  alert_retry_btn: "दोबारा प्रयास करें",
  blur_detected: "दस्तावेज़ और फ़ोन स्थिर रखें",
  camera_angle_too_steep: "दस्तावेज़ को फ़ोन के समानांतर रखें",
  document_filtered: "दस्तावेज़ स्वीकार नहीं किया गया",
  document_filtered_details:
    "किसी भिन्न दस्तावेज़ को स्कैन करने का प्रयास करें.",
  document_not_recognized: "डॉक्यूमेंट पहचाना नहीं गया",
  document_not_recognized_details:
    "समर्थित दस्तावेज़ के सामने वाले भाग को स्कैन करें.",
  document_too_close_to_edge: "दस्तावेज़ को किनारे से हटाएँ",
  face_photo_not_fully_visible:
    "चेहरे की तस्वीर इस तरह रखें की पूरी तरह से दिखाई दे",
  flip_document: "दस्तावेज़ को पलटें",
  flip_to_back_side: "पीछे की ओर पलटें",
  glare_detected:
    "प्रतिबिंब हटाने के लिए दस्तावेज़ को झुकाएँ या ट्रान्सफर करें",
  help_aria_label: "सहायता",
  help_modal_back_btn: "पिछला",
  help_modal_details_1:
    "सुनिश्चित करें कि आप दस्तावेज़ के किसी भी हिस्से को, जिसमें नीचे की रेखाएँ भी शामिल हैं, उंगली से न ढकें. साथ ही, दस्तावेज़ के फील्ड पर पड़ने वाले होलोग्राम प्रतिबिंबों पर भी ध्यान दें.",
  help_modal_details_2:
    "सीधी और तेज़ रोशनी से बचें क्योंकि यह दस्तावेज़ से रिफ्लेक्ट होकर दस्तावेज़ के कुछ हिस्सों को पढ़ने में दिक्कत ला सकती है. अगर आप दस्तावेज़ पर मौजूद डेटा नहीं पढ़ पा रहे हैं, तो वह कैमरे को भी दिखाई नहीं देगा.",
  help_modal_details_3:
    "स्कैन करते समय फ़ोन और दस्तावेज़ को स्थिर रखने का प्रयास करें. किसी भी चीज़ को हिलाने से तस्वीर धुंधली हो सकती है और दस्तावेज़ पर मौजूद डेटा पढ़ने योग्य नहीं रहेगा.",
  help_modal_done_btn: "हो गया",
  help_modal_next_btn: "अगला",
  help_modal_title_1: "इस प्रकार रखें की सभी फील्ड पूरी तरह दिखाई दे",
  help_modal_title_2: "कठोर प्रकाश से सावधान रहें",
  help_modal_title_3: "स्कैन करते समय स्थिर रहें",
  help_tooltip: "मदद चाहिए?",
  move_closer: "पास आएँ",
  move_farther: "दूर जाएँ",
  move_left: "बाईं ओर के पेज पर जाएँ",
  move_right: "दाईं ओर के पेज पर जाएँ",
  move_top: "टॉप पेज पर जाएँ",
  occluded: "दस्तावेज़ को इस प्रकार रखें की यह पूरी तरह दिखाई दे",
  onboarding_modal_btn: "स्कैन करना शुरू करें",
  onboarding_modal_details:
    "सुनिश्चित करें कि दस्तावेज़ पर अच्छी रोशनी हो. सभी दस्तावेज़ फ़ील्ड कैमरा स्क्रीन पर दिखाई देने चाहिए.",
  onboarding_modal_title: "इस प्रकार रखें की सभी जानकारी पूरी तरह दिखाई दे",
  scan_data_page: "दस्तावेज़ के डेटा पेज को स्कैन करें",
  scan_last_page_barcode: "आख़िरी पेज से बारकोड स्कैन करें",
  scan_left_page: "बाएँ पेज को स्कैन करें",
  scan_right_page: "दाएँ पेज को स्कैन करें",
  scan_the_back_side: "दस्तावेज़ के पीछे की ओर स्कैन करें",
  scan_the_barcode: "बारकोड को स्कैन करें",
  scan_the_front_side: "दस्तावेज़ के सामने वाले भाग को स्कैन करें",
  scan_top_page: "टॉप पेज को स्कैन करें",
  scan_unsuccessful: "स्कैन असफल हुआ",
  scan_unsuccessful_details:
    "दस्तावेज़ पढ़ा नहीं जा सका. कृपया दोबारा प्रयास करें.",
  too_bright: "कम रोशनी वाले स्थान पर जाएँ",
  too_dark: "अधिक रोशनी वाले स्थान पर जाएँ",
  wrong_left: "बाएं पेज पर जाएँ",
  wrong_right: "सही पेज पर जाएँ",
  wrong_top: "टॉप पेज पर जाएँ",
} as const;
