/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "გაუქმება",
  alert_retry_btn: "ხელახლა ცდა",
  blur_detected: "არ გაამოძრაოთ დოკუმენტი და ტელეფონი",
  camera_angle_too_steep: "დოკუმენტი ტელეფონის პარალელურად დაიჭირეთ",
  document_filtered: "დოკუმენტი უარყოფილია",
  document_filtered_details: "სცადეთ სხვა დოკუმენტის დასკანერება.",
  document_not_recognized: "დოკუმენტის ამოცნობა ვერ მოხერხდა",
  document_not_recognized_details:
    "დაასკანერეთ მხარდაჭერილი დოკუმენტის წინა მხარე.",
  document_too_close_to_edge: "მოაშორეთ დოკუმენტი კიდეს",
  face_photo_not_fully_visible: "სახის ფოტო სრულად უნდა ჩანდეს",
  flip_document: "ამოატრიალეთ დოკუმენტი",
  flip_to_back_side: "შემოატრიალეთ უკანა მხარეს",
  glare_detected: "გადახარეთ ან გაამოძრავეთ დოკუმენტი ანარეკლის მოსაშორებლად",
  help_aria_label: "დახმარება",
  help_modal_back_btn: "უკან",
  help_modal_details_1:
    "დარწმუნდით, რომ თითით დოკუმენტის ნაწილებს არ ფარავთ, მათ შორის ქვედა ხაზებსაც. ასევე, ფრთხილად იყავით ჰოლოგრამულ ანარეკლებთანაც, რომლებიც დოკუმენტის ველებზე გადადის.",
  help_modal_details_2:
    "მოერიდეთ პირდაპირ მკვეთრ განათებას, რადგან ის დოკუმენტზე ანარეკლს აჩენს და დოკუმენტის ნაწილები შესაძლოა გარჩევადი აღარ იყოს. თუ დოკუმენტში მოცემულ მონაცემებს ვერ კითხულობთ, მას ვერც კამერა დააფიქსირებს.",
  help_modal_details_3:
    "დასკანერებისას ეცადეთ არ გაამოძრაოთ ტელეფონი და დოკუმენტი. გამოძრავების შემთხვევაში ფოტო შეიძლება დაიბუროს და დოკუმენტში ასახული მონაცემები გარჩევადი არ იყოს.",
  help_modal_done_btn: "დასრულდა",
  help_modal_next_btn: "შემდეგი",
  help_modal_title_1: "ყველა ველი უნდა ჩანდეს",
  help_modal_title_2: "მოერიდეთ მკვეთრ განათებას",
  help_modal_title_3: "არ იმოძრაოთ დასკანერებისას",
  help_tooltip: "დახმარება გჭირდებათ?",
  move_closer: "მიუახლოვდით",
  move_farther: "გადადით მოშორებით",
  move_left: "გადადით მარცხენა გვერდზე",
  move_right: "გადადით მარჯვენა გვერდზე",
  move_top: "გადადით ზედა გვერდზე",
  occluded: "დოკუმენტი სრულად უნდა ჩანდეს",
  onboarding_modal_btn: "დასკანერების დაწყება",
  onboarding_modal_details:
    "დარწმუნდით, რომ დოკუმენტი კარგად არის განათებული. კამერის ეკრანზე დოკუმენტის ყველა ველი უნდა ჩანდეს.",
  onboarding_modal_title: "ყველა დეტალი უნდა ჩანდეს",
  scan_data_page: "დაასკანერეთ დოკუმენტის მონაცემების გვერდი",
  scan_last_page_barcode: "დაასკანერეთ შტრიხკოდი ბოლო გვერდიდან",
  scan_left_page: "დაასკანერეთ მარცხენა გვერდი",
  scan_right_page: "დაასკანერეთ მარჯვენა გვერდი",
  scan_the_back_side: "დაასკანერეთ დოკუმენტის უკანა მხარე",
  scan_the_barcode: "დაასკანერეთ ბარკოდი",
  scan_the_front_side: "დაასკანერეთ დოკუმენტის წინა მხარე",
  scan_top_page: "დაასკანერეთ ზედა გვერდი",
  scan_unsuccessful: "სკანირება წარუმატებელია",
  scan_unsuccessful_details:
    "დოკუმენტის წაკითხვა ვერ ხერხდება. ხელახლა სცადეთ.",
  too_bright: "გადადით ნაკლებად განათებულ ადგილას",
  too_dark: "გადადით უფრო განათებულ ადგილას",
  wrong_left: "გადადით მარცხენა გვერდზე",
  wrong_right: "გადადით მარჯვენა გვერდზე",
  wrong_top: "გადადით ზედა გვერდზე",
} as const;
