/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "रद्द गर्नुहोस्",
  alert_retry_btn: "पुन: प्रयास गर्नुहोस्",
  blur_detected: "कागजात र फोन नहल्लाइ राख्नुहोस्",
  camera_angle_too_steep: "कागजातलाई फोनको समानान्तर राख्नुहोस्",
  document_filtered: "कागजात स्वीकार्य भएन",
  document_filtered_details: "फरक कागजात स्क्यान गरेर हेर्नुहोस्",
  document_not_recognized: "कागजात पहिचान हुन सकेन",
  document_not_recognized_details:
    "सपोर्ट हुने कागजातको अगाडि पट्टिको भाग स्क्यान गर्नुहोस्।",
  document_too_close_to_edge: "कागजातलाई किनाराबाट हटाउनुहोस्",
  face_photo_not_fully_visible: "फेस फोटो पूर्ण रूपमा देखिने गरी राख्नुहोस्",
  flip_document: "कागजात फ्लिप गर्नुहोस्",
  flip_to_back_side: "पछाडि पट्टि फ्लिप गर्नुहोस्",
  glare_detected: "रिफ्लेक्सन हटाउन कागजात ढल्क्याउनुहोस् वा हटाउनुहोस्",
  help_aria_label: "मद्दत",
  help_modal_back_btn: "पछाडि",
  help_modal_details_1:
    "कागजातको तल्लो रेखा लगायत तपाईंले औंलाले कागजातको केही भागहरू ढाक्नुभएको छैन भनी सुनिश्चित गर्नुहोस्। यस बाहेक, कागजातका भागहरू माथि जाने होलोग्राम रिफ्लेक्सन हुने कुरा पनि ध्यान दिनुहोस्।",
  help_modal_details_2:
    "कागजातमा रिफ्लेक्सन आउने र केही भाग पढ्न नसकिने हुँदा सिधा र कडा प्रकाशबाट बच्नुहोस्। तपाईंले कागजातमा रहेका डाटा पढ्न सक्नु भएन भने क्यामेरामा पनि देख्न सक्दैन।",
  help_modal_details_3:
    "स्क्यान गर्दा फोन वा कागजात स्थिर राख्न प्रयास गर्नुहोस्। दुबैमध्ये एउटा मात्रा चल्दा पनि तस्वीर धमिलो हुन सक्छ र कागजातमा भएको डाटा पढ्न नसकिने हुन सक्छ।",
  help_modal_done_btn: "भयो",
  help_modal_next_btn: "अर्को",
  help_modal_title_1: "फिल्डहरू देखिनेगरी राख्नुहोस्",
  help_modal_title_2: "तेजिलो प्रकाशबाट जोगिनुहोस्।",
  help_modal_title_3: "स्क्यान गर्दा नहल्लिनुहोस्",
  help_tooltip: "सहयोग चाहिन्छ?",
  move_closer: "नजिक जानुहोस्",
  move_farther: "पर जानुहोस्",
  move_left: "पृष्ठको बायाँपट्टि जानुहोस्",
  move_right: "पृष्ठको दायाँपट्टि जानुहोस्",
  move_top: "पृष्ठको माथिल्लो भागमा जानुहोस्",
  occluded: "कागजातलाई पूर्ण रूपमा देखिने गरी राख्नुहोस्",
  onboarding_modal_btn: "स्क्यान सुरु गर्नुहोस्",
  onboarding_modal_details:
    "कागजात उज्यालो राख्नुहोस्। सबै कागजात फिल्ड क्यामेरा स्क्रिनमा देखिने हुनुपर्छ।",
  onboarding_modal_title: "विवरणहरू देखिनेगरी राख्नुहोस्",
  scan_data_page: "कागजको डाटा पृष्ठ स्क्यान गर्नुहोस्",
  scan_last_page_barcode: "अन्तिम पृष्ठमा भएको बारकोड स्क्यान गर्नुहोस्।",
  scan_left_page: "बायाँ पृष्ठ स्क्यान गर्नुहोस्",
  scan_right_page: "दायाँ पृष्ठ स्क्यान गर्नुहोस्",
  scan_the_back_side: "कागजातको फपछाडिपट्टिको भाग स्क्यान गर्नुहोस्",
  scan_the_barcode: "बारकोड स्क्यान गर्नुहोस्",
  scan_the_front_side: "कागजातको अगाडिपट्टिको भाग स्क्यान गर्नुहोस्",
  scan_top_page: "माथिल्लो पृष्ठ स्क्यान गर्नुहोस्",
  scan_unsuccessful: "स्क्यान हुन सकेन",
  scan_unsuccessful_details: "कागजात पढ्न सकेन। कृपया पुन: प्रेस गर्नुहोस्।",
  too_bright: "कम उज्यालो स्पटमा जानुहोस्",
  too_dark: "सबैभन्दा चम्किलो स्पटमा जानुहोस्",
  wrong_left: "बायाँ पृष्ठमा जानुहोस्",
  wrong_right: "दायाँ पृष्ठमा जानुहोस्",
  wrong_top: "माथिल्लो पृष्ठमा जानुहोस्",
} as const;
