/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "Отменить",
  alert_retry_btn: "Попробовать еще",
  blur_detected: "Держите документ и телефон неподвижно",
  camera_angle_too_steep: "Держите документ параллельно телефону",
  document_filtered: "Документ не поддерживается",
  document_filtered_details: "Попробуйте отсканировать другой документ.",
  document_not_recognized: "Документ не распознан",
  document_not_recognized_details:
    "Отсканируйте лицевую сторону поддерживаемого документа.",
  document_too_close_to_edge: "Уберите документ подальше от края",
  face_photo_not_fully_visible:
    "Сделайте так, чтобы фотография лица была видна полностью",
  flip_document: "Переверните документ",
  flip_to_back_side: "Переверните документ на обратную сторону",
  glare_detected: "Наклоните или сместите документ, чтобы убрать отражение",
  help_aria_label: "Помощь",
  help_modal_back_btn: "Назад",
  help_modal_details_1:
    "Следите за тем, чтобы вы не закрывали части документа пальцами, включая нижние строки. Кроме того, старайтесь, чтобы голограммы не бросали блики на поля документа.",
  help_modal_details_2:
    "Избегайте прямого яркого света, так как он отражается от документа и может сделать некоторые его части нечитаемыми. Если вы не можете прочитать данные документа сами, то они не будут видны и камере.",
  help_modal_details_3:
    "В процессе сканирования старайтесь держать телефон и документ неподвижно. Любое движение может привести к размытию изображения и сделать данные нечитаемыми.",
  help_modal_done_btn: "Готово",
  help_modal_next_btn: "Далее",
  help_modal_title_1: "Следите за тем, чтобы все поля были видны",
  help_modal_title_2: "Избегайте яркой засветки",
  help_modal_title_3: "Не двигайтесь в процессе сканирования",
  help_tooltip: "Нужна помощь?",
  move_closer: "Сместитесь поближе",
  move_farther: "Сместитесь подальше",
  move_left: "Сместитесь на страницу слева",
  move_right: "Сместитесь на страницу справа",
  move_top: "Сместитесь на страницу сверху",
  occluded: "Сделайте так, чтобы документ был виден полностью",
  onboarding_modal_btn: "Начать сканирование",
  onboarding_modal_details:
    "Сделайте так, чтобы документ был хорошо освещен. Все его поля должны быть видны на экране камеры.",
  onboarding_modal_title: "Следите за тем, чтобы все элементы были видны",
  scan_data_page: "Отсканируйте страницу с данными документа",
  scan_last_page_barcode: "Отсканируйте штрихкод с последней страницы",
  scan_left_page: "Отсканируйте левую страницу",
  scan_right_page: "Отсканируйте правую страницу",
  scan_the_back_side: "Отсканируйте обратную сторону документа",
  scan_the_barcode: "Отсканируйте штрихкод",
  scan_the_front_side: "Отсканируйте лицевую сторону документа",
  scan_top_page: "Отсканируйте верхнюю страницу",
  scan_unsuccessful: "Не удалось отсканировать документ",
  scan_unsuccessful_details:
    "Не удалось прочитать документ. Повторите попытку.",
  too_bright: "Перейдите в менее освещенное место",
  too_dark: "Перейдите в более освещенное место",
  wrong_left: "Сместитесь на левую страницу",
  wrong_right: "Сместитесь на правую страницу",
  wrong_top: "Сместитесь на верхнюю страницу",
} as const;
