/**
 * Copyright (c) 2025 Microblink Ltd. All rights reserved.
 */

export default {
  alert_cancel_btn: "Скасувати",
  alert_retry_btn: "Повторити спробу",
  blur_detected: "Тримайте документ і телефон нерухомо",
  camera_angle_too_steep: "Тримайте документ паралельно телефону",
  document_filtered: "Документ не прийнято",
  document_filtered_details: "Спробуйте відсканувати інший документ.",
  document_not_recognized: "Документ не розпізнано",
  document_not_recognized_details:
    "Відскануйте лицьову сторону підтримуваного документа.",
  document_too_close_to_edge: "Відсуньте документ від краю",
  face_photo_not_fully_visible: "Тримайте фото обличчя повністю видимим",
  flip_document: "Переверніть документ",
  flip_to_back_side: "Переверніть на зворотній бік",
  glare_detected: "Нахиліть або перемістіть документ, щоб прибрати відблиск",
  help_aria_label: "Допомога",
  help_modal_back_btn: "Назад",
  help_modal_details_1:
    "Переконайтеся, що ви не закриваєте частини документа пальцем, зокрема нижні рядки. Також стежте за відблисками від голограм, які перекривають поля документа.",
  help_modal_details_2:
    "Уникайте прямого яскравого світла, адже воно відбивається від документа і може зробити частини документа нечитабельними. Якщо ви не можете прочитати дані на документі, камера їх також не зчитає.",
  help_modal_details_3:
    "Намагайтеся тримати телефон і документ нерухомо під час сканування. Рух одного з них може розмити зображення та зробити дані на документі нечитабельними.",
  help_modal_done_btn: "Готово",
  help_modal_next_btn: "Далі",
  help_modal_title_1: "Тримайте всі поля видимими",
  help_modal_title_2: "Обережно з яскравим світлом",
  help_modal_title_3: "Не рухайтеся під час сканування",
  help_tooltip: "Потрібна допомога?",
  move_closer: "Наблизьтесь",
  move_farther: "Віддаляйтесь",
  move_left: "Перейдіть на сторінку ліворуч",
  move_right: "Перейдіть на сторінку праворуч",
  move_top: "Перейдіть на верхню сторінку",
  occluded: "Тримайте документ повністю у полі зору",
  onboarding_modal_btn: "Почати сканування",
  onboarding_modal_details:
    "Переконайтеся, що документ добре освітлений. Усі поля документа мають бути видимими на екрані камери.",
  onboarding_modal_title: "Тримайте всі деталі видимими",
  scan_data_page: "Відскануйте сторінку з даними документа",
  scan_last_page_barcode: "Відскануйте штрихкод з останньої сторінки",
  scan_left_page: "Відскануйте ліву сторінку",
  scan_right_page: "Відскануйте праву сторінку",
  scan_the_back_side: "Скануйте зворотній бік документа",
  scan_the_barcode: "Відскануйте штрих-код",
  scan_the_front_side: "Відскануйте лицьову сторону документа",
  scan_top_page: "Відскануйте верхню сторінку",
  scan_unsuccessful: "Сканування не вдалося",
  scan_unsuccessful_details:
    "Не вдалося зчитати документ. Будь ласка, спробуйте ще раз.",
  too_bright: "Перейдіть у місце з менш яскравим освітленням",
  too_dark: "Перейдіть у більш освітлене місце",
  wrong_left: "Перейдіть на ліву сторінку",
  wrong_right: "Перейдіть на праву сторінку",
  wrong_top: "Перейдіть на верхню сторінку",
} as const;
